Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lcdc.c
/**
  ******************************************************************************
  * @file    py32e407_hal_lcdc.c
  * @author  MCU Application Team
  * @brief   LCDC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Serial Peripheral Interface (LCDC) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
    [..]
      The LCDC HAL driver can be used as follows:

      (#) Declare a LCDC_HandleTypeDef handle structure, for example:
          LCDC_HandleTypeDef  hlcdc;

      (#)Initialize the LCDC low level resources by implementing the HAL_LCDC_MspInit() API:
          (##) Enable the LCDCx interface clock
          (##) LCDC pins configuration
              (+++) Enable the clock for the LCDC GPIOs
              (+++) Configure these LCDC pins as alternate function push-pull
          (##) DMA Configuration if you need to use DMA process
              (+++) Declare a DMA_HandleTypeDef handle structure for the transmit Stream/Channel
              (+++) Enable the DMAx clock
              (+++) Configure the DMA handle parameters
              (+++) Configure the DMA Tx Stream/Channel
              (+++) Associate the initialized hdma_tx handle to the hlcdc DMA Tx handle
              (+++) Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA Tx Stream/Channel

      (#) Program the Interface mode, write ADDSET time, DATAST time, DATAHLD time and 
          read ADDSET time, DATAST time, DATAHLD time in the hlcdc Init structure.

      (#) Initialize the LCDC registers by calling the HAL_LCDC_Init() API:
          (++) This API configures also the low level Hardware GPIO, CLOCK, CORTEX...etc)
              by calling the customized HAL_LCDC_MspInit() API.
     [..]
       Callback registration:

      (#) The compilation flag USE_HAL_LCDC_REGISTER_CALLBACKS when set to 1U
          allows the user to configure dynamically the driver callbacks.
          Use Functions HAL_LCDC_RegisterCallback() to register an interrupt callback.

          Function HAL_LCDC_RegisterCallback() allows to register following callbacks:
            (++) ErrorCallback         : LCDC Error callback
            (++) WriteCpltCallback     : LCDC Write completed callback
            (++) MspInitCallback       : LCDC Msp Init callback
            (++) MspDeInitCallback     : LCDC Msp DeInit callback
          This function takes as parameters the HAL peripheral handle, the Callback ID
          and a pointer to the user callback function.


      (#) Use function HAL_LCDC_UnRegisterCallback to reset a callback to the default
          weak function.
          HAL_LCDC_UnRegisterCallback takes as parameters the HAL peripheral handle,
          and the Callback ID.
          This function allows to reset following callbacks:
            (++) ErrorCallback         : LCDC Error callback
            (++) WriteCpltCallback     : LCDC Write completed callback
            (++) MspInitCallback       : LCDC Msp Init callback
            (++) MspDeInitCallback     : LCDC Msp DeInit callback

       [..]
       By default, after the HAL_LCDC_Init() and when the state is HAL_LCDC_STATE_RESET
       all callbacks are set to the corresponding weak functions.
       Exception done for MspInit and MspDeInit functions that are
       reset to the legacy weak functions in the HAL_LCDC_Init()/ HAL_LCDC_DeInit() only when
       these callbacks are null (not registered beforehand).
       If MspInit or MspDeInit are not null, the HAL_LCDC_Init()/ HAL_LCDC_DeInit()
       keep and use the user MspInit/MspDeInit callbacks (registered beforehand) whatever the state.

       [..]
       Callbacks can be registered/unregistered in HAL_LCDC_STATE_READY state only.
       Exception done MspInit/MspDeInit functions that can be registered/unregistered
       in HAL_LCDC_STATE_READY or HAL_LCDC_STATE_RESET state,
       thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
       Then, the user first registers the MspInit/MspDeInit user callbacks
       using HAL_LCDC_RegisterCallback() before calling HAL_LCDC_DeInit()
       or HAL_LCDC_Init() function.

       [..]
       When the compilation define USE_HAL_PPP_REGISTER_CALLBACKS is set to 0 or
       not defined, the callback registering feature is not available
       and weak (surcharged) callbacks are used.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx_hal.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @defgroup LCDC LCDC
  * @brief LCDC HAL module driver
  * @{
  */
#ifdef HAL_LCDC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/** @defgroup LCDC_Private_Constants LCDC Private Constants
  * @{
  */

/**
  * @}
  */

