Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lcdc.c
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup LCDC_Private_Functions LCDC Private Functions
  * @{
  */
static void LCDC_DMAWriteCplt(DMA_HandleTypeDef *hdma);
static void LCDC_DMAError(DMA_HandleTypeDef *hdma);
static HAL_StatusTypeDef LCDC_WaitOnFlagUntilTimeout(LCDC_HandleTypeDef *hlcdc, 
                                                     uint32_t Flag, 
                                                     FlagStatus Status,
                                                     uint32_t Timeout, 
                                                     uint32_t Tickstart);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup LCDC_Exported_Functions LCDC Exported Functions
  * @{
  */

/** @defgroup LCDC_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          de-initialize the LCDCx peripheral:

      (+) User must implement HAL_LCDC_MspInit() function in which he configures
          all related peripherals resources (CLOCK, GPIO, DMA).

      (+) Call the function HAL_LCDC_Init() to configure the selected device with
          the selected configuration:
        (++) Interface Mode
        (++) Write access timing: ADDSET time
        (++) Write access timing: DATAST time
        (++) Write access timing: DATAHLD time
        (++) Read access timing: ADDSET time
        (++) Read access timing: DATAST time
        (++) Read access timing: DATAHLD time

      (+) Call the function HAL_LCDC_DeInit() to restore the default configuration
          of the selected LCDCx peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the LCDC according to the specified parameters
  *         in the LCDC_InitTypeDef and initialize the associated handle.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_Init(LCDC_HandleTypeDef *hlcdc)
{

  /* Check the LCDC handle allocation */
  if (hlcdc == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_LCDC_ALL_INSTANCE(hlcdc->Instance));
  assert_param(IS_LCDC_MODE(hlcdc->Init.Mode));
  assert_param(IS_LCDC_ADDSET(hlcdc->Init.Write.AddSet));
  assert_param(IS_LCDC_DATAST(hlcdc->Init.Write.DataSt));
  assert_param(IS_LCDC_DATAHOLD(hlcdc->Init.Write.DataHold));
  assert_param(IS_LCDC_ADDSET(hlcdc->Init.Read.AddSet));
  assert_param(IS_LCDC_DATAST(hlcdc->Init.Read.DataSt));
  assert_param(IS_LCDC_DATAHOLD(hlcdc->Init.Read.DataHold));

  if (hlcdc->State == HAL_LCDC_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hlcdc->Lock = HAL_UNLOCKED;

#if (USE_HAL_LCDC_REGISTER_CALLBACKS == 1U)
    /* Init the LCDC Callback settings */
    hlcdc->WriteCpltCallback   = HAL_LCDC_WriteCpltCallback;   /* Legacy weak WriteCpltCallback   */
    hlcdc->ErrorCallback       = HAL_LCDC_ErrorCallback;       /* Legacy weak ErrorCallback       */

    if (hlcdc->MspInitCallback == NULL)
    {
      hlcdc->MspInitCallback = HAL_LCDC_MspInit; /* Legacy weak MspInit  */
    }

    /* Init the low level hardware : GPIO, CLOCK... */
    hlcdc->MspInitCallback(hlcdc);
#else
    /* Init the low level hardware : GPIO, CLOCK... */
    HAL_LCDC_MspInit(hlcdc);
#endif /* USE_HAL_LCDC_REGISTER_CALLBACKS */
  }

  hlcdc->State = HAL_LCDC_STATE_BUSY;

  if(hlcdc->Instance == LCDC0)
  {
    /* Disable the selected LCDC peripheral */
    CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_EN0);

    /* Configure LCDC0 mode */
    MODIFY_REG(LCDC0123_COMMON->CSR, LCDC_CSR_MODE0, hlcdc->Init.Mode << LCDC_CSR_MODE0_Pos); 
  }
  else if(hlcdc->Instance == LCDC1)
  {
    /* Disable the selected LCDC peripheral */
    CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_EN1);

    /* Configure LCDC1 mode */
    MODIFY_REG(LCDC0123_COMMON->CSR, LCDC_CSR_MODE1, hlcdc->Init.Mode << LCDC_CSR_MODE1_Pos); 
  }
  else if(hlcdc->Instance == LCDC2)
  {
    /* Disable the selected LCDC peripheral */
    CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_EN2);

    /* Configure LCDC2 mode */
    MODIFY_REG(LCDC0123_COMMON->CSR, LCDC_CSR_MODE2, hlcdc->Init.Mode << LCDC_CSR_MODE2_Pos); 
  }
  else if(hlcdc->Instance == LCDC3)
  {
    /* Disable the selected LCDC peripheral */
    CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_EN3);

    /* Configure LCDC3 mode */
    MODIFY_REG(LCDC0123_COMMON->CSR, LCDC_CSR_MODE3, hlcdc->Init.Mode << LCDC_CSR_MODE3_Pos); 
  }
  else
  {
    hlcdc->State = HAL_LCDC_STATE_RESET;
    return HAL_ERROR;
  }

  /*----------------------- LCDCx WCFGR & RCFGR Configuration ---------------------*/
  /* Configure : address setup time , data-phase duration and data hold time for write
     access */
  WRITE_REG(hlcdc->Instance->WCFGR, ((hlcdc->Init.Write.AddSet & LCDC_WCFGR_ADDSET) |
                                     ((hlcdc->Init.Write.DataSt << LCDC_WCFGR_DATAST_Pos) & LCDC_WCFGR_DATAST) |
                                     ((hlcdc->Init.Write.DataHold << LCDC_WCFGR_DATAHLD_Pos) & LCDC_WCFGR_DATAHLD)));
  
  /* Configure : address setup time , data-phase duration and data hold time for read
     access */
  WRITE_REG(hlcdc->Instance->RCFGR, ((hlcdc->Init.Read.AddSet & LCDC_RCFGR_ADDSET) |
                                     ((hlcdc->Init.Read.DataSt << LCDC_RCFGR_DATAST_Pos) & LCDC_RCFGR_DATAST) |
                                     ((hlcdc->Init.Read.DataHold << LCDC_RCFGR_DATAHLD_Pos) & LCDC_RCFGR_DATAHLD)));

  hlcdc->ErrorCode = HAL_LCDC_ERROR_NONE;
  hlcdc->State     = HAL_LCDC_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  De-Initialize the LCDC peripheral.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_DeInit(LCDC_HandleTypeDef *hlcdc)
{
  /* Check the LCDC handle allocation */
  if (hlcdc == NULL)
  {
    return HAL_ERROR;
  }

