Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lcdc.c
  /* Check LCDC Instance parameter */
  assert_param(IS_LCDC_ALL_INSTANCE(hlcdc->Instance));

  hlcdc->State = HAL_LCDC_STATE_BUSY;

  /* Disable the selected LCDC peripheral */
   __HAL_LCDC_DISABLE(hlcdc);


#if (USE_HAL_LCDC_REGISTER_CALLBACKS == 1U)
  if (hlcdc->MspDeInitCallback == NULL)
  {
    hlcdc->MspDeInitCallback = HAL_LCDC_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware: GPIO, CLOCK... */
  hlcdc->MspDeInitCallback(hlcdc);
#else
  /* DeInit the low level hardware: GPIO, CLOCK... */
  HAL_LCDC_MspDeInit(hlcdc);
#endif /* USE_HAL_LCDC_REGISTER_CALLBACKS */

  hlcdc->ErrorCode = HAL_LCDC_ERROR_NONE;
  hlcdc->State = HAL_LCDC_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hlcdc);

  return HAL_OK;
}

/**
  * @brief  Initialize the LCDC MSP.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval None
  */
__weak void HAL_LCDC_MspInit(LCDC_HandleTypeDef *hlcdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlcdc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LCDC_MspInit should be implemented in the user file
   */
}

/**
  * @brief  De-Initialize the LCDC MSP.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval None
  */
__weak void HAL_LCDC_MspDeInit(LCDC_HandleTypeDef *hlcdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlcdc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LCDC_MspDeInit should be implemented in the user file
   */
}

#if (USE_HAL_LCDC_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User LCDC Callback
  *         To be used instead of the weak predefined callback
  * @param  hlcdc Pointer to a LCDC_HandleTypeDef structure that contains
  *                the configuration information for the specified LCDC.
  * @param  CallbackID ID of the callback to be registered
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_RegisterCallback(LCDC_HandleTypeDef *hlcdc, HAL_LCDC_CallbackIDTypeDef CallbackID,
                                           pLCDC_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hlcdc->ErrorCode |= HAL_LCDC_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }
  /* Process locked */
  __HAL_LOCK(hlcdc);

  if (HAL_LCDC_STATE_READY == hlcdc->State)
  {
    switch (CallbackID)
    {
      case HAL_LCDC_WRITECPLT_CB_ID :
        hlcdc->WriteCpltCallback = pCallback;
        break;

      case HAL_LCDC_ERROR_CB_ID :
        hlcdc->ErrorCallback = pCallback;
        break;

      case HAL_LCDC_MSPINIT_CB_ID :
        hlcdc->MspInitCallback = pCallback;
        break;

      case HAL_LCDC_MSPDEINIT_CB_ID :
        hlcdc->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_LCDC_STATE_RESET == hlcdc->State)
  {
    switch (CallbackID)
    {
      case HAL_LCDC_MSPINIT_CB_ID :
        hlcdc->MspInitCallback = pCallback;
        break;

      case HAL_LCDC_MSPDEINIT_CB_ID :
        hlcdc->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_INVALID_CALLBACK);

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hlcdc);
  return status;
}

/**
  * @brief  Unregister an LCDC Callback
  *         LCDC callback is redirected to the weak predefined callback
  * @param  hlcdc Pointer to a LCDC_HandleTypeDef structure that contains
  *                the configuration information for the specified LCDC.
  * @param  CallbackID ID of the callback to be unregistered
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_UnRegisterCallback(LCDC_HandleTypeDef *hlcdc, HAL_LCDC_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hlcdc);

  if (HAL_LCDC_STATE_READY == hlcdc->State)
  {
    switch (CallbackID)
    {
      case HAL_LCDC_WRITECPLT_CB_ID :
        hlcdc->WriteCpltCallback = HAL_LCDC_WriteCpltCallback;       /* Legacy weak WriteCpltCallback    */
        break;

      case HAL_LCDC_ERROR_CB_ID :
        hlcdc->ErrorCallback = HAL_LCDC_ErrorCallback;               /* Legacy weak ErrorCallback        */
        break;

      case HAL_LCDC_MSPINIT_CB_ID :
        hlcdc->MspInitCallback = HAL_LCDC_MspInit;                   /* Legacy weak MspInit              */
        break;

      case HAL_LCDC_MSPDEINIT_CB_ID :
        hlcdc->MspDeInitCallback = HAL_LCDC_MspDeInit;               /* Legacy weak MspDeInit            */
        break;

      default :
        /* Update the error code */
        SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_LCDC_STATE_RESET == hlcdc->State)
  {
    switch (CallbackID)
    {
      case HAL_LCDC_MSPINIT_CB_ID :
        hlcdc->MspInitCallback = HAL_LCDC_MspInit;                   /* Legacy weak MspInit              */
        break;

      case HAL_LCDC_MSPDEINIT_CB_ID :
        hlcdc->MspDeInitCallback = HAL_LCDC_MspDeInit;               /* Legacy weak MspDeInit            */
        break;

      default :
        /* Update the error code */
        SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_INVALID_CALLBACK);

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hlcdc);
  return status;
}
#endif /* USE_HAL_LCDC_REGISTER_CALLBACKS */
/**
  * @}
  */

