Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lcdc.c
/** @defgroup LCDC_Exported_Functions_Group2 IO operation functions
  *  @brief   Data transfers functions
  *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
 ===============================================================================
 [..]
    This subsection provides a set of functions allowing to manage the LCDC
    data transfers.

    [..] The LCDC supports 8080 and 6800 mode :

    (#) There are two modes of transfer:
       (++) Blocking mode: The communication is performed in polling mode.
            The HAL status of all data processing is returned by the same function
            after finishing transfer.
       (++) No-Blocking mode: The communication is performed using DMA, 
            These APIs return the HAL status.
            The end of the data processing will be indicated through 
            the DMA IRQ when using DMA mode.
            The HAL_LCDC_ErrorCallback()user callback will be executed when a communication error is detected

@endverbatim
  * @{
  */

/**
  * @brief  Write an amount of data in blocking mode.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @param  pData pointer to data buffer
  * @param  Size amount of data to be sent
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_WriteData(LCDC_HandleTypeDef *hlcdc, uint8_t *pData, uint32_t Size, uint32_t Timeout)
{
  uint32_t tickstart;

  if (hlcdc->State == HAL_LCDC_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    /* Check DataSize parameter */
    assert_param(IS_LCDC_DATASIZE(hlcdc->Init.DataSize));

    /* Process Locked */
    __HAL_LOCK(hlcdc);

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* Set the transaction information */
    hlcdc->State       = HAL_LCDC_STATE_BUSY_WRITE_DATA;
    hlcdc->ErrorCode   = HAL_LCDC_ERROR_NONE;
    hlcdc->pBuffPtr    = (uint8_t *)pData;
    hlcdc->XferSize    = Size;
    hlcdc->XferCount   = Size;
    
    /* Enable LCDC */
    __HAL_LCDC_ENABLE(hlcdc);

    while(hlcdc->XferCount > 0U)
    {
      /* Wait until BUSY flag is clear */
      if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }

      switch (hlcdc->Init.DataSize)
      {
        case LCDC_DATASIZE_8BIT:
          *((__IO uint8_t *)&hlcdc->Instance->DR) = (*(uint8_t*)hlcdc->pBuffPtr) & 0xFFU;
          hlcdc->pBuffPtr++;
        break;

        case LCDC_DATASIZE_9BIT:
          *((__IO uint16_t *)&hlcdc->Instance->DR) = (*(uint16_t*)hlcdc->pBuffPtr) & 0x1FFU;
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_DATASIZE_16BIT:
          *((__IO uint16_t *)&hlcdc->Instance->DR) = (*(uint16_t*)hlcdc->pBuffPtr) & 0xFFFFU;
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_DATASIZE_18BIT:
          *((__IO uint32_t *)&hlcdc->Instance->DR) = (*(uint32_t*)hlcdc->pBuffPtr) & 0x3FFFFU;
          hlcdc->pBuffPtr += 4;
        break;

        default:
        break;
      }

      hlcdc->XferCount--;
    }

    /* Wait until BUSY flag is clear */
    if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    
    /* Disable LCDC */
    __HAL_LCDC_DISABLE(hlcdc);

    hlcdc->State = HAL_LCDC_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hlcdc);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Read an amount of data in blocking mode.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @param  pData pointer to data buffer
  * @param  Size amount of data to be read
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_ReadData(LCDC_HandleTypeDef *hlcdc, uint8_t *pData, uint32_t Size, uint32_t Timeout)
{ 
  uint32_t tickstart;

  if (hlcdc->State == HAL_LCDC_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    /* Check DataSize parameter */
    assert_param(IS_LCDC_DATASIZE(hlcdc->Init.DataSize));

    /* Process Locked */
    __HAL_LOCK(hlcdc);

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* Set the transaction information */
    hlcdc->State       = HAL_LCDC_STATE_BUSY_READ_DATA;
    hlcdc->ErrorCode   = HAL_LCDC_ERROR_NONE;
    hlcdc->pBuffPtr    = (uint8_t *)pData;
    hlcdc->XferSize    = Size;
    hlcdc->XferCount   = Size;

    /* Enable LCDC */
    __HAL_LCDC_ENABLE(hlcdc);
    
    while(hlcdc->XferCount > 0U)
    {
      /* Wait until BUSY flag is clear */
      if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }

      switch (hlcdc->Init.DataSize)
      {
        case LCDC_DATASIZE_8BIT:
          *((uint8_t *)hlcdc->pBuffPtr) = ( uint8_t )(hlcdc->Instance->DR & 0xFFU);
          hlcdc->pBuffPtr++;
        break;

        case LCDC_DATASIZE_9BIT:
          *((uint16_t *)hlcdc->pBuffPtr) = ( uint16_t )(hlcdc->Instance->DR & 0x1FFU);
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_DATASIZE_16BIT:
          *((uint16_t *)hlcdc->pBuffPtr) = ( uint16_t )(hlcdc->Instance->DR & 0xFFFFU);
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_DATASIZE_18BIT:
          *((uint32_t *)hlcdc->pBuffPtr) = ( uint32_t )(hlcdc->Instance->DR & 0x3FFFFU);
          hlcdc->pBuffPtr += 4;
        break;

        default:
        break;
      }

      hlcdc->XferCount--;
    }

    /* Wait until BUSY flag is clear */
    if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    
    /* Disable LCDC */
    __HAL_LCDC_DISABLE(hlcdc);

    hlcdc->State = HAL_LCDC_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hlcdc);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Write an amount of data in no-blocking mode with DMA.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @param  pData pointer to data buffer
  * @param  Size amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_WriteData_DMA(LCDC_HandleTypeDef *hlcdc, uint8_t *pData, uint32_t Size)
{
  uint32_t status;

  if (hlcdc->State == HAL_LCDC_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    /* Check DataSize parameter */
    assert_param(IS_LCDC_DATASIZE(hlcdc->Init.DataSize));
    
    /* Only 8bit and 16bit formats are supported */
    if ((hlcdc->hdmatx->Init.DstWidth != DMA_DST_WIDTH_HALFWORD) && (hlcdc->hdmatx->Init.DstWidth != DMA_DST_WIDTH_BYTE))
    {
      return  HAL_ERROR;
    }

    /* Process Locked */
    __HAL_LOCK(hlcdc);

