Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lcdc.c
    /* Set the transaction information */
    hlcdc->State       = HAL_LCDC_STATE_BUSY_WRITE_DATA;
    hlcdc->ErrorCode   = HAL_LCDC_ERROR_NONE;
    hlcdc->pBuffPtr    = (uint8_t *)pData;
    hlcdc->XferSize    = Size;
    hlcdc->XferCount   = Size;

    if(hlcdc->hdmatx != NULL)
    {
      /* Set the LCDC DMA transfer complete callback */
      hlcdc->hdmatx->XferCpltCallback = LCDC_DMAWriteCplt;

      /* Set the DMA error callback */
      hlcdc->hdmatx->XferErrorCallback = LCDC_DMAError;

      /* Enable the LCDC DMA channel */
      status = HAL_DMA_Start_IT(hlcdc->hdmatx, (uint32_t)pData, (uint32_t)&hlcdc->Instance->DR, Size);
    }

    if (status == HAL_OK)
    {
      /* Process Unlocked */
      __HAL_UNLOCK(hlcdc);

      /* Enable the DMA transfer for transmit request by setting the DMAEN bit
         in the LCDC COMMON register */
      SET_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_DMAEN);
      
      /* Enable LCDC */
      __HAL_LCDC_ENABLE(hlcdc);

      return HAL_OK;
    }
    else
    {
      /* Set error code to DMA */
      hlcdc->ErrorCode = HAL_LCDC_ERROR_DMA;

      /* Process Unlocked */
      __HAL_UNLOCK(hlcdc);

      /* Restore hlcdc->State to ready */
      hlcdc->State = HAL_LCDC_STATE_READY;

      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Write an amount of cmd in blocking mode.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @param  pCmd pointer to Cmd buffer
  * @param  Size amount of data to be sent
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_WriteCmd(LCDC_HandleTypeDef *hlcdc, uint8_t *pCmd, uint32_t Size, uint32_t Timeout)
{
  uint32_t tickstart;

  if (hlcdc->State == HAL_LCDC_STATE_READY)
  {
    if ((pCmd == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    /* Check DataSize parameter */
    assert_param(IS_LCDC_DATASIZE(hlcdc->Init.CmdSize));

    /* Process Locked */
    __HAL_LOCK(hlcdc);

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* Set the transaction information */
    hlcdc->State       = HAL_LCDC_STATE_BUSY_WRITE_CMD;
    hlcdc->ErrorCode   = HAL_LCDC_ERROR_NONE;
    hlcdc->pBuffPtr    = (uint8_t *)pCmd;
    hlcdc->XferSize    = Size;
    hlcdc->XferCount   = Size;
    
    /* Enable LCDC */
    __HAL_LCDC_ENABLE(hlcdc);

    while(hlcdc->XferCount > 0U)
    {
      /* Wait until BUSY flag is clear */
      if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }

      switch (hlcdc->Init.CmdSize)
      {
        case LCDC_CMDSIZE_8BIT:
          *((__IO uint8_t *)&hlcdc->Instance->CMDR) = (*(hlcdc->pBuffPtr) & 0xFFU);
          hlcdc->pBuffPtr++;
        break;

        case LCDC_CMDSIZE_9BIT:
          *((__IO uint16_t *)&hlcdc->Instance->CMDR) = (*(uint16_t*)hlcdc->pBuffPtr) & 0x1FFU;
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_CMDSIZE_16BIT:
          *((__IO uint16_t *)&hlcdc->Instance->CMDR) = (*(uint16_t*)hlcdc->pBuffPtr) & 0xFFFFU;
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_CMDSIZE_18BIT:
          *((__IO uint32_t *)&hlcdc->Instance->CMDR) = (*(uint32_t*)hlcdc->pBuffPtr) & 0x3FFFFU;
          hlcdc->pBuffPtr += 4;
        break;

        default:
        break;
      }

      hlcdc->XferCount--;
    }

    /* Wait until BUSY flag is clear */
    if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    /* Disable LCDC */
    __HAL_LCDC_DISABLE(hlcdc);
    
    hlcdc->State = HAL_LCDC_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hlcdc);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Read an amount of data in blocking mode.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @param  pCmd pointer to data buffer
  * @param  Size amount of data to be read
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_ReadCmd(LCDC_HandleTypeDef *hlcdc, uint8_t *pCmd, uint32_t Size, uint32_t Timeout)
{ 
  uint32_t tickstart;

  if (hlcdc->State == HAL_LCDC_STATE_READY)
  {
    if ((pCmd == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    /* Check DataSize parameter */
    assert_param(IS_LCDC_DATASIZE(hlcdc->Init.DataSize));

    /* Process Locked */
    __HAL_LOCK(hlcdc);

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* Set the transaction information */
    hlcdc->State       = HAL_LCDC_STATE_BUSY_READ_CMD;
    hlcdc->ErrorCode   = HAL_LCDC_ERROR_NONE;
    hlcdc->pBuffPtr    = (uint8_t *)pCmd;
    hlcdc->XferSize    = Size;
    hlcdc->XferCount   = Size;
    
    /* Enable LCDC */
    __HAL_LCDC_ENABLE(hlcdc);

    while(hlcdc->XferCount > 0U)
    {
      /* Wait until BUSY flag is clear */
      if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }

      switch (hlcdc->Init.DataSize)
      {
        case LCDC_DATASIZE_8BIT:
          *((uint8_t *)hlcdc->pBuffPtr) = ( uint8_t )(hlcdc->Instance->CMDR & 0xFFU);
          hlcdc->pBuffPtr++;
        break;

        case LCDC_DATASIZE_9BIT:
          *((uint16_t *)hlcdc->pBuffPtr) = ( uint16_t )(hlcdc->Instance->CMDR & 0x1FFU);
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_DATASIZE_16BIT:
          *((uint16_t *)hlcdc->pBuffPtr) = ( uint16_t )(hlcdc->Instance->CMDR & 0xFFFFU);
          hlcdc->pBuffPtr += 2;
        break;

        case LCDC_DATASIZE_18BIT:
          *((uint32_t *)hlcdc->pBuffPtr) = ( uint32_t )(hlcdc->Instance->CMDR & 0x3FFFFU);
          hlcdc->pBuffPtr += 4;
        break;

        default:
        break;
      }

      hlcdc->XferCount--;
    }

    /* Wait until BUSY flag is clear */
    if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, Timeout, tickstart) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    
    /* Disable LCDC */
    __HAL_LCDC_DISABLE(hlcdc);

    hlcdc->State = HAL_LCDC_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hlcdc);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Abort ongoing transfer (blocking mode).
  * @param  hlcdc LCDC handle.
  * @note   This procedure could be used for aborting any ongoing transfer,
  *         started in DMA mode.
  *         This procedure performs following operations :
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LCDC_Abort(LCDC_HandleTypeDef *hlcdc)
{
  uint32_t tickstart;

