Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lcdc.c
  /* Abort the LCDC DMA channel if enabled */
  if (HAL_IS_BIT_SET(LCDC0123_COMMON->CSR, LCDC_CSR_DMAEN))
  {
    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* Abort the LCDC DMA Tx Stream/Channel : use blocking DMA Abort API (no callback) */
    if (hlcdc->hdmatx != NULL)
    {
      /* Set the LCDC DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hlcdc->hdmatx->XferAbortCallback = NULL;

      /* Abort DMA Tx Handle linked to LCDC Peripheral */
      if (HAL_DMA_Abort(hlcdc->hdmatx) != HAL_OK)
      {
        hlcdc->ErrorCode = HAL_LCDC_ERROR_ABORT;
        return HAL_ERROR;
      }
      
      /* Disable the LCDC DMA request if enabled */
      CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_DMAEN);

      /* Wait until BUSY flag is clear */
      if (LCDC_WaitOnFlagUntilTimeout(hlcdc, LCDC_FLAG_BUSY, SET, 1000, tickstart) != HAL_OK)
      {
        hlcdc->ErrorCode = HAL_LCDC_ERROR_ABORT;
        return HAL_ERROR;
      }
    }
  }

  /* Reset transfer counters */
  hlcdc->XferCount = 0U;

  /* Reset errorCode */
  hlcdc->ErrorCode = HAL_LCDC_ERROR_NONE;
 
  /* Restore hlcdc->state to ready */
  hlcdc->State = HAL_LCDC_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Write completed callback.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval None
  */
__weak void HAL_LCDC_WriteCpltCallback(LCDC_HandleTypeDef *hlcdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlcdc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LCDC_WriteCpltCallback should be implemented in the user file
   */
}

/**
  * @brief  Error callback.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval None
  */
__weak void HAL_LCDC_ErrorCallback(LCDC_HandleTypeDef *hlcdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlcdc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LCDC_ErrorCallback should be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup LCDC_Exported_Functions_Group3 Peripheral State and Errors functions
  * @brief   LCDC control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the LCDC.
     (+) HAL_LCDC_GetState() API can be helpful to check in run-time the state of the LCDC peripheral
     (+) HAL_LCDC_GetError() check in run-time Errors occurring during communication
@endverbatim
  * @{
  */

/**
  * @brief  Return the LCDC handle state.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval LCDC state
  */
HAL_LCDC_StateTypeDef HAL_LCDC_GetState(LCDC_HandleTypeDef *hlcdc)
{
  /* Return LCDC handle state */
  return hlcdc->State;
}

/**
  * @brief  Return the LCDC error code.
  * @param  hlcdc pointer to a LCDC_HandleTypeDef structure that contains
  *               the configuration information for LCDC module.
  * @retval LCDC error code in bitmap format
  */
uint32_t HAL_LCDC_GetError(LCDC_HandleTypeDef *hlcdc)
{
  /* Return LCDC ErrorCode */
  return hlcdc->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup LCDC_Private_Functions
  * @brief   Private functions
  * @{
  */

/**
  * @brief  This function handles LCDC Communication Timeout. It waits
  *                until a flag is no longer in the specified status.
  * @param  hlcdc Pointer to a LCDC_HandleTypeDef structure that contains
  *                the configuration information for the specified LCDC.
  * @param  Flag Specifies the LCDC flag to check.
  * @param  Status The actual Flag status (SET or RESET).
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval HAL status
  */
static HAL_StatusTypeDef LCDC_WaitOnFlagUntilTimeout(LCDC_HandleTypeDef *hlcdc, uint32_t Flag, FlagStatus Status,
                                                     uint32_t Timeout, uint32_t Tickstart)
{
  while (__HAL_LCDC_GET_FLAG(LCDC0123_COMMON, Flag) == Status)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
      {
        if ((__HAL_LCDC_GET_FLAG(LCDC0123_COMMON, Flag) == Status))
        {
          /* Disable LCDC */
          __HAL_LCDC_DISABLE(hlcdc);
          
          hlcdc->ErrorCode |= HAL_LCDC_ERROR_TIMEOUT;
          hlcdc->State = HAL_LCDC_STATE_READY;

          /* Process Unlocked */
          __HAL_UNLOCK(hlcdc);
          return HAL_ERROR;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  DMA LCDC write process complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA module.
  * @retval None
  */
static void LCDC_DMAWriteCplt(DMA_HandleTypeDef *hdma)
{
  LCDC_HandleTypeDef *hlcdc = (LCDC_HandleTypeDef *)(((DMA_HandleTypeDef *)hdma)->Parent); /* Derogation MISRAC2012-Rule-11.5 */

  /* DMA Normal Mode */
  if (hdma->Init.Mode == DMA_NORMAL)
  {
    /* Disable DMA Request */
    CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_DMAEN);
    
    /* Disable LCDC */
    __HAL_LCDC_DISABLE(hlcdc);

    hlcdc->XferCount = 0U;
    hlcdc->State = HAL_LCDC_STATE_READY;

  }
  /* Call user write complete callback */
#if (USE_HAL_LCDC_REGISTER_CALLBACKS == 1U)
  hlcdc->WriteCpltCallback(hlcdc);
#else
  HAL_LCDC_WriteCpltCallback(hlcdc);
#endif /* USE_HAL_LCDC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA LCDC error callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA module.
  * @retval None
  */
static void LCDC_DMAError(DMA_HandleTypeDef *hdma)
{
  LCDC_HandleTypeDef *hlcdc = (LCDC_HandleTypeDef *)(((DMA_HandleTypeDef *)hdma)->Parent); /* Derogation MISRAC2012-Rule-11.5 */

  /* Disable DMA Request */
  CLEAR_BIT(LCDC0123_COMMON->CSR, LCDC_CSR_DMAEN);
  
  /* Disable LCDC */
    __HAL_LCDC_DISABLE(hlcdc);

  SET_BIT(hlcdc->ErrorCode, HAL_LCDC_ERROR_DMA);
  hlcdc->State = HAL_LCDC_STATE_READY;

  /* Call user error callback */
#if (USE_HAL_LCDC_REGISTER_CALLBACKS == 1U)
  hlcdc->ErrorCallback(hlcdc);
#else
  HAL_LCDC_ErrorCallback(hlcdc);
#endif /* USE_HAL_LCDC_REGISTER_CALLBACKS */
}

/**
  * @}
  */

#endif /* HAL_LCDC_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
